---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.SolidRevolve
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.SolidRevolve

Creates a 3D shape by sweeping a 2D profile around an axis.